In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [15]:
ser1 = Series(np.arange(3), index = ["A", "B", "C"])
ser1

A    0
B    1
C    2
dtype: int32

In [7]:
ser1.drop("B")

A    0
C    2
dtype: int64

In [13]:
dframe1 = DataFrame(np.arange(9).reshape(3, 3), index = ["LA", "SF", "NY"], columns = ["pop", "size", "year"])
dframe1

    pop  size  year
LA    0     1     2
SF    3     4     5
NY    6     7     8

In [17]:
# drop row
dframe1.drop("SF")

    pop  size  year
LA    0     1     2
NY    6     7     8

In [22]:
# above does not alter original obj
dframe1

    pop  size  year
LA    0     1     2
SF    3     4     5
NY    6     7     8

In [24]:
# to make drop permanent, save to another obj
dframe2 = dframe1.drop("SF")
dframe2

    pop  size  year
LA    0     1     2
NY    6     7     8

In [28]:
# drop columns --- axis 0(default) = rows, axis 1 = columns
dframe1.drop('size', axis = 1)

    pop  year
LA    0     2
SF    3     5
NY    6     8